In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ········

------------------
1.List the number of films per category.
------------------

In [4]:
%%sql
select * from sakila.film
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 1, None, 3, Decimal('4.99'), 48, Decimal('12.99'), 'G', 'Trailers,Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 1, None, 7, Decimal('2.99'), 50, Decimal('18.99'), 'NC-17', 'Trailers,Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 1, None, 5, Decimal('2.99'), 117, Decimal('26.99'), 'G', 'Commentaries,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 1, None, 6, Decimal('2.99'), 130, Decimal('22.99'), 'G', 'Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

In [14]:
%%sql
select * from sakila.film_category
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 6, datetime.datetime(2006, 2, 15, 5, 7, 9)),
 (2, 11, datetime.datetime(2006, 2, 15, 5, 7, 9)),
 (3, 6, datetime.datetime(2006, 2, 15, 5, 7, 9)),
 (4, 11, datetime.datetime(2006, 2, 15, 5, 7, 9)),
 (5, 8, datetime.datetime(2006, 2, 15, 5, 7, 9))]

In [7]:
%%sql
select * from sakila.category
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 4, 46, 27))]

In [15]:
%%sql
select c.name, count(f.film_id) num_films_per_cat
from sakila.category as c
join sakila.film_category as fc on c.category_id = fc.category_id
join sakila.film as f on f.film_id = fc.film_id
group by c.name
order by num_films_per_cat desc
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('Sports', 74),
 ('Foreign', 73),
 ('Family', 69),
 ('Documentary', 68),
 ('Animation', 66),
 ('Action', 64),
 ('New', 63),
 ('Drama', 62),
 ('Sci-Fi', 61),
 ('Games', 61)]

------
2.Display the first and the last names, as well as the address, of each staff member.
------------------

In [16]:
%%sql
select * from sakila.staff
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[(1, 'Mike', 'Hillyer', 3, 'Mike.Hillyer@sakilastaff.com', 1, 1, 'Mike', '8cb2237d0679ca88db6464eac60da96345513964', datetime.datetime(2006, 2, 15, 3, 57, 16)),
 (2, 'Jon', 'Stephens', 4, 'Jon.Stephens@sakilastaff.com', 2, 1, 'Jon', None, datetime.datetime(2006, 2, 15, 3, 57, 16)),
 (3, 'TAMMY', 'SANDERS', 79, 'TAMMY:SANDERS@sakilacustomer.org', 2, 1, 'tammy', None, datetime.datetime(2022, 10, 19, 17, 9, 36))]

In [17]:
%%sql
select * from sakila.address
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\\\xc0v\x1f\xdb\x8d\x99\xd9H@', datetime.datetime(2014, 9, 25, 22, 30, 27)),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10\xd4\xdf\x81$c@N\xe0\x8cP"\xa2;\xc0', datetime.datetime(2014, 9, 25, 22, 30, 9)),
 (3, '23 Workhaven Lane', None, 'Alberta', 300, '', '14033335568', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xcd\xc4\x19hc4\\\xc0\x1d\xee~p\x99\xd9H@', datetime.datetime(2014, 9, 25, 22, 30, 27)),
 (4, '1411 Lillydale Drive', None, 'QLD', 576, '', '6172235589', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00[\r\xe44\x1f&c@B\xd6\xaed"\xa2;\xc0', datetime.datetime(2014, 9, 25, 22, 30, 9)),
 (5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00(\xd17\x0e!7`@\xab\xb5\x8b\xc4_\x94@@', datetime.datetime(2014, 9, 25, 22, 31, 53))]

In [19]:
%%sql
select concat(s.first_name, ' ', s.last_name) as name, a.address
from sakila.staff as s
join sakila.address as a on a.address_id = s.address_id
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[('Mike Hillyer', '23 Workhaven Lane'),
 ('Jon Stephens', '1411 Lillydale Drive'),
 ('TAMMY SANDERS', '1551 Rampur Lane')]

---------------------
3.Display the total amount rung up by each staff member in August 2005.
---------------------------

In [20]:
%%sql
select * from sakila.staff
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[(1, 'Mike', 'Hillyer', 3, 'Mike.Hillyer@sakilastaff.com', 1, 1, 'Mike', '8cb2237d0679ca88db6464eac60da96345513964', datetime.datetime(2006, 2, 15, 3, 57, 16)),
 (2, 'Jon', 'Stephens', 4, 'Jon.Stephens@sakilastaff.com', 2, 1, 'Jon', None, datetime.datetime(2006, 2, 15, 3, 57, 16)),
 (3, 'TAMMY', 'SANDERS', 79, 'TAMMY:SANDERS@sakilacustomer.org', 2, 1, 'tammy', None, datetime.datetime(2022, 10, 19, 17, 9, 36))]

In [21]:
%%sql
select s.staff_id, concat(s.first_name,' ',s.last_name) as employee, sum(p.amount) as `total amount`
from sakila.staff as s
inner join sakila.payment as p
on s.staff_id = p.staff_id
where month(p.payment_date) = 8 and year(p.payment_date) = 2005
group by s.staff_id;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'Mike Hillyer', Decimal('11853.65')),
 (2, 'Jon Stephens', Decimal('12216.49'))]

--------------------------
4.List all films and the number of actors who are listed for each film.
---------------------------

In [22]:
%%sql
select * from sakila.actor
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (2, 'NICK', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (3, 'ED', 'CHASE', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (4, 'JENNIFER', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (5, 'JOHNNY', 'LOLLOBRIGIDA', datetime.datetime(2006, 2, 15, 4, 34, 33))]

In [24]:
%%sql
select * from sakila.film
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

In [26]:
%%sql
select * from sakila.film_actor
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 1, datetime.datetime(2006, 2, 15, 5, 5, 3)),
 (1, 23, datetime.datetime(2006, 2, 15, 5, 5, 3)),
 (1, 25, datetime.datetime(2006, 2, 15, 5, 5, 3)),
 (1, 106, datetime.datetime(2006, 2, 15, 5, 5, 3)),
 (1, 140, datetime.datetime(2006, 2, 15, 5, 5, 3))]

In [29]:
%%sql
select f.title as filmtitle, count(fa.actor_id) as numactors
from sakila.film as f
join sakila.film_actor as fa on f.film_id = fa.film_id
group by f.film_id
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('ACADEMY DINOSAUR', 10),
 ('ACE GOLDFINGER', 4),
 ('ADAPTATION HOLES', 5),
 ('AFFAIR PREJUDICE', 5),
 ('AFRICAN EGG', 5)]

-----------------
5.Using the payment and the customer tables as well as the JOIN command, list the total amount paid by each customer. List the customers alphabetically by their last names.
--------------

In [30]:
%%sql
select * from sakila.customer
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20))]

In [31]:
%%sql
select * from sakila.payment
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, 1, 76, Decimal('2.99'), datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.datetime(2006, 2, 15, 22, 12, 30))]

In [32]:
%%sql
select concat(c.first_name, ' ', c.last_name) as nombre, sum(p.amount) as totalamount
from sakila.payment as p
join sakila.customer as c on c.customer_id = p.customer_id
group by c.customer_id
order by c.last_name
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('RAFAEL ABNEY', Decimal('97.79')),
 ('NATHANIEL ADAM', Decimal('133.72')),
 ('KATHLEEN ADAMS', Decimal('92.73')),
 ('DIANA ALEXANDER', Decimal('105.73')),
 ('GORDON ALLARD', Decimal('160.68'))]